app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 24]]
---
  <%= link_to book_favorites_path(book), method: :delete, remote: true, class: 'small favorite' do %>
    ♥<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 23]]
---
  <%= link_to book_favorites_path(book), method: :post, remote: true, class: 'small favorite-destroy' do %>
    ♡<%= book.favorites.count %>