app/views/comments/_comments.html.erb

<div class="mb-3">
  <div class="border-bottom"><%= book_find.book_comments.count %>件のコメント</div>
  <div><%= attachment_image_tag book_comment.user, :profile_image, size: "30x30", format:'jpeg' %></div>
  <% book_find.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 24]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 24]]