app/views/book_comments/_comments.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 11]]
---
<div><%= attachment_image_tag book_comment.user, :profile_image, size: "30x30", format:'jpeg' %></div>
<% book_find.book_comments.each do |book_comment| %>

INSERT INTO "book_comments" ("comment", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["book_id", 11], ["user_id", 5], ["created_at", "2021-06-02 08:05:53.817482"], ["updated_at", "2021-06-02 08:05:53.817482"]]
---
    </div>
    <div class="mb-1 small"><%= book_comment.created_at.strftime('%Y/%m/%d') %></div>