app/views/book_comments/_comment_counts.html.erb

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 11]]
---
<%= book_find.book_comments.count %><br>コメント