app/views/users/index.html.erb

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follower_id" = ? LIMIT ?  [["user_id", 5], ["follower_id", 2], ["LIMIT", 1]]
---
            <% if current_user.following?(user) %>
              <td><%= link_to 'Unfollow', relationship_path(current_user.relationships.find_by(follower: user)),method: :delete,class: "btn  btn-sm btn-info" %></td>