app/views/users/show.html.erb

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follower_id" = ? LIMIT ?  [["user_id", 5], ["follower_id", 2], ["LIMIT", 1]]
---
          <% if current_user.following?(@user) %>
            <%= link_to 'Unfollow', relationship_path(current_user.relationships.find_by(follower: @user)),method: :delete,class: "btn  btn-sm btn-outline-info btn-block" %>

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 11]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 24]]
---
          <td><%= book.body %></td>
          <td><%= link_to "コメント#{book.book_comments.count}件", book_path(book), class: "small" %></td>