app/views/users/show.html.erb

            <% if current_user.following?(@user) %>
              <%= link_to 'Unfollow', relationship_path(current_user.relationships.find_by(follower: @user)),method: :delete,class: "btn  btn-sm btn-outline-info btn-block" %>
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follower_id" = ? LIMIT ?  [["user_id", 5], ["follower_id", 1], ["LIMIT", 1]]