app/views/books/_books.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 24]]
---
          <%= link_to book_favorites_path(book), method: :delete, class: 'favorite' do %>
            ♥<%= book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 23]]
---
          <%= link_to book_favorites_path(book), method: :post, class: 'favorite-destroy' do %>
            ♡<%= book.favorites.count %> いいね

SELECT "books".* FROM "books" WHERE (title LIKE'%たのしい%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 24]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 24]]
---

      <td class="small"><%= link_to "コメント#{book.book_comments.count}件", book_path(book) %></td>