app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 11]]
---
                <%= link_to book_favorites_path(book), method: :delete do %>
                  ♥<%= book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 24]]
---
                <%= link_to book_favorites_path(book), method: :post do %>
                  ♡<%= book.favorites.count %> いいね

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 24]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 24]]
---
            <% end %>
            <td class="small"><%= link_to "コメント#{book.post_comments.count}件", book_path(book) %></td>