app/views/books/index.html.erb

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 11]]
---

            <td class="small"><%= link_to "#{book.book_comments.count}コメント", book_path(book) %></td>