app/views/books/show.html.erb

          <%= link_to show_following_user_path(@book_find.user) do %>
            <%= @book_find.user.followings.count %><br>Following
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follower_id" WHERE "relationships"."user_id" = ?  [["user_id", 5]]

          <%= link_to show_followers_user_path(@book_find.user) do %>
            <%= @book_find.user.followers.count %><br>Followers
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."user_id" WHERE "relationships"."follower_id" = ?  [["follower_id", 5]]

            <% if current_user.following?(@book_find.user) %>
              <%= link_to 'Unfollow', relationship_path(current_user.relationships.find_by(follower: @book_find.user)),method: :delete,class: "btn  btn-sm btn-outline-info btn-block" %>
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follower_id" = ? LIMIT ?  [["user_id", 5], ["follower_id", 2], ["LIMIT", 1]]

          <%= link_to book_favorites_path(@book_find), method: :delete, class: 'favorite' do %>
            ♥<%= @book_find.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 24]]

          <%= link_to book_favorites_path(@book_find), method: :post, class: 'favorite-destroy' do %>
            ♡<%= @book_find.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 24]]

      <div class="mb-3">
        <div class="border-bottom"><%= @book_find.book_comments.count %>件のコメント</div>
        <div><%= attachment_image_tag @book_comment.user, :profile_image, size: "30x30", format:'jpeg' %></div>
        <% @book_find.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 24]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 24]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 24]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 24]]