app/views/books/tag_index.html.erb

SELECT "books".* FROM "books" INNER JOIN "tag_maps" ON "books"."id" = "tag_maps"."book_id" WHERE "tag_maps"."tag_id" = ?  [["tag_id", 5]]
SELECT COUNT(*) FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 24]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 23]]
---
            <td><%= book.body %></td>
            <td><%= link_to "コメント#{book.book_comments.count}件", book_path(book.id), class:"small" %></td>