app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @book_comment = BookComment.new
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = @book.id
    comment.save
    unless comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["book_id", 11], ["user_id", 5], ["created_at", "2021-06-02 08:24:15.028483"], ["updated_at", "2021-06-02 08:24:15.028483"]]
INSERT INTO "book_comments" ("comment", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test"], ["book_id", 11], ["user_id", 5], ["created_at", "2021-06-02 08:22:38.660783"], ["updated_at", "2021-06-02 08:22:38.660783"]]

  def destroy
    @book = Book.find(params[:book_id])
    @book_comment = BookComment.new
    comment = BookComment.find_by(id:params[:id], book_id:params[:book_id])
    comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 12], ["book_id", 11], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 12]]