app/controllers/books_controller.rb

  def index
    books = Book.includes(:favorited_users).sort {|a,b| b.favorited_users.size <=> a.favorited_users.size}
    @books = Kaminari.paginate_array(books).page(params[:page]).per(10)
    @book = Book.new
    @user_id = current_user
    @tag_list = Tag.all
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 24]]
SELECT COUNT(*) FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follower_id" WHERE "relationships"."user_id" = ?  [["user_id", 5]]
SELECT "books".* FROM "books"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?, ?)  [["book_id", 1], ["book_id", 11], ["book_id", 23], ["book_id", 24]]
SELECT "tags".* FROM "tags"

  def create
    @book = Book.new(book_params)
    tag_list = params[:book][:tag_name].split(nil)
    @book.user_id = current_user.id
    if @book.save
      @book.save_tag(tag_list)
      redirect_to book_path(@book), notice:'You have created book successfully.'
    else
      @books = Book.page(params[:page]).reverse_order
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "たのしいRuby"], ["body", "Rubyの入門におすすめです。"], ["user_id", 5], ["created_at", "2021-05-22 14:34:49.543572"], ["updated_at", "2021-05-22 14:34:49.543572"]]
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag_name", "専門書　Ruby"], ["created_at", "2021-05-22 14:38:54.755592"], ["updated_at", "2021-05-22 14:38:54.755592"]]
SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]

  def show
    @book_find = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

  def tag_index
    @book = Book.new
    @user_id = current_user
    @tag = Tag.find(params[:tag_id])
    @tag_books = Tag.find(params[:tag_id]).books.all
    @books = Book.page(params[:page]).reverse_order
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "books".* FROM "books" INNER JOIN "tag_maps" ON "books"."id" = "tag_maps"."book_id" WHERE "tag_maps"."tag_id" = ?  [["tag_id", 5]]
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "books"