app/controllers/books_controller.rb

SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @books = Book.page(params[:page]).reverse_order

SELECT "books".* FROM "books" WHERE (title LIKE '%b%')
---
  def search
    if params[:title].present?
      @books = Book.where('title LIKE ?', "%#{params[:title]}%")