app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    @other_user = User.find(params[:follower])

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."id" = ? LIMIT ?  [["user_id", 5], ["id", 2], ["LIMIT", 1]]
---
  def destroy
    @user = current_user.relationships.find(params[:id]).follower