app/controllers/searches_controller.rb

  def search
    @range = params[:range]
    search = params[:search]
    word = params[:word]

    if @range == '1'
      @users = User.search(search,word)
    else
      @books = Book.search(search,word)
---
SELECT "users".* FROM "users" WHERE (name LIKE'%ゲスト%')
SELECT "books".* FROM "books" WHERE (title LIKE '%たのしい%')