app/models/book.rb

SELECT "tags"."tag_name" FROM "tags" INNER JOIN "tag_maps" ON "tags"."id" = "tag_maps"."tag_id" WHERE "tag_maps"."book_id" = ?  [["book_id", 17]]
INSERT INTO "tags" ("tag_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["tag_name", "専門書　Ruby"], ["created_at", "2021-05-22 14:38:54.755592"], ["updated_at", "2021-05-22 14:38:54.755592"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."tag_name" = ? LIMIT ?  [["tag_name", "専門書　Ruby"], ["LIMIT", 1]]
---
  def save_tag(sent_tags)
    current_tags = self.tags.pluck(:tag_name) unless self.tags.nil?
    old_tags = current_tags - sent_tags
    new_tags = sent_tags - current_tags

    old_tags.each do |old|
      self.tags.delete Tag.find_by(tag_name: old)
    end

    new_tags.each do |new|
      new_book_tag = Tag.find_or_create_by(tag_name: new)