app/models/user.rb

INSERT INTO "relationships" ("user_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["follower_id", 2], ["created_at", "2021-05-24 07:46:47.549969"], ["updated_at", "2021-05-24 07:46:47.549969"]]
---
  def follow(other_user)
    return if self == other_user
    relationships.find_or_create_by!(follower: other_user)

SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follower_id" WHERE "relationships"."user_id" = ? AND "users"."id" = ? LIMIT ?  [["user_id", 5], ["id", 2], ["LIMIT", 1]]
---
  def following?(user)
    followings.include?(user)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]
---
  def unfollow(relationship_id)
    relationships.find(relationship_id).destroy!